
# encoding: UTF-8
#Егоренков 08-ПО1

# Пример использования. Подключили модуль, вызвали функцию:
# print_solution(1){|str|
#  puts str;
# };
# Где 1 - это номер варианта, а str - это просто строка, которую надо вывести куда-либо. 

## №        ||     Сn3        || Вид пыли       || Сведения об источнике пыли                            || 
##варианта  ||    мг/м^3      ||  % SiO2        || H, м       || Д, м      || V, м^3/ч    || Tr, K       ||
$variants = [
{:N => 1     , :Cn =>  8000.0  , :Dust=>  ">70"  , :H => 50.0  , :D => 1.3  , :V => 17000.0, :Tr => 373.0 },
{:N => 2     , :Cn =>  9000.0  , :Dust=>  ">70"  , :H => 55.0  , :D => 1.2  , :V => 21000.0, :Tr => 348.0 },
{:N => 3     , :Cn => 10000.0  , :Dust=>"10-70"  , :H => 60.0  , :D => 1.5  , :V => 31000.0, :Tr => 335.0 },
{:N => 4     , :Cn => 11000.0  , :Dust=>"10-70"  , :H => 62.0  , :D => 1.6  , :V => 40000.0, :Tr => 330.0 },
{:N => 5     , :Cn => 12000.0  , :Dust=> "2-10"  , :H => 55.0  , :D => 1.2  , :V => 15000.0, :Tr => 333.0 },
{:N => 6     , :Cn => 13000.0  , :Dust=>"10-70"  , :H => 58.0  , :D => 1.4  , :V => 32000.0, :Tr => 347.0 },
{:N => 7     , :Cn => 14000.0  , :Dust=>  ">70"  , :H => 65.0  , :D => 2.0  , :V => 51000.0, :Tr => 343.0 },
{:N => 8     , :Cn => 15000.0  , :Dust=>  ">70"  , :H => 60.0  , :D => 1.5  , :V => 26000.0, :Tr => 345.0 },
{:N => 9     , :Cn => 16000.0  , :Dust=>"10-70"  , :H => 80.0  , :D => 1.2  , :V => 29000.0, :Tr => 353.0 },
{:N =>10     , :Cn => 17000.0  , :Dust=>"10-70"  , :H => 75.0  , :D => 1.3  , :V => 17000.0, :Tr => 358.0 },
{:N =>11     , :Cn =>  8000.0  , :Dust=> "2-10"  , :H =>100.0  , :D => 1.6  , :V => 15000.0, :Tr => 363.0 },
{:N =>12     , :Cn =>  9000.0  , :Dust=> "2-10"  , :H => 95.0  , :D => 1.4  , :V => 23000.0, :Tr => 367.0 },
{:N =>13     , :Cn => 10000.0  , :Dust=>  ">70"  , :H => 90.0  , :D => 1.2  , :V => 25000.0, :Tr => 373.0 },
{:N =>14     , :Cn => 11000.0  , :Dust=>  ">70"  , :H => 85.0  , :D => 1.2  , :V => 18000.0, :Tr => 352.0 },
{:N =>15     , :Cn => 12000.0  , :Dust=>"10-70"  , :H => 70.0  , :D => 1.5  , :V => 33000.0, :Tr => 328.0 },
{:N =>16     , :Cn => 13000.0  , :Dust=>"10-70"  , :H => 75.0  , :D => 1.2  , :V => 11000.0, :Tr => 335.0 },

{:N =>17     , :Cn => 14000.0  , :Dust=> "2-10"  , :H => 60.0  , :D => 2.0  , :V => 46000.0, :Tr => 338.0 },
{:N =>18     , :Cn => 15000.0  , :Dust=> "2-10"  , :H => 65.0  , :D => 2.2  , :V => 55000.0, :Tr => 343.0 },
{:N =>19     , :Cn =>  8000.0  , :Dust=>  ">70"  , :H => 70.0  , :D => 1.7  , :V => 40000.0, :Tr => 351.0 },
{:N =>20     , :Cn =>  9000.0  , :Dust=>  ">70"  , :H => 50.0  , :D => 1.4  , :V => 28000.0, :Tr => 348.0 },
{:N =>21     , :Cn => 10000.0  , :Dust=>"10-70"  , :H => 55.0  , :D => 1.6  , :V => 32000.0, :Tr => 358.0 },
{:N =>22     , :Cn => 11000.0  , :Dust=>"10-70"  , :H => 65.0  , :D => 1.3  , :V => 22000.0, :Tr => 360.0 },

{:N =>23     , :Cn => 12000.0  , :Dust=> "2-10"  , :H => 56.0  , :D => 1.8  , :V => 48000.0, :Tr => 368.0 },
{:N =>24     , :Cn => 13000.0  , :Dust=> "2-10"  , :H => 60.0  , :D => 1.5  , :V => 24000.0, :Tr => 340.0 },
{:N =>25     , :Cn => 14000.0  , :Dust=>  ">70"  , :H => 70.0  , :D => 2.0  , :V => 57000.0, :Tr => 356.0 },
{:N =>26     , :Cn => 15000.0  , :Dust=>"10-70"  , :H => 75.0  , :D => 2.1  , :V => 65000.0, :Tr => 333.0 },
{:N =>27     , :Cn => 12000.0  , :Dust=>"  >70"  , :H => 55.0  , :D => 1.5  , :V => 30000.0, :Tr => 350.0 },
{:N =>28     , :Cn => 13000.0  , :Dust=>"10-70"  , :H => 65.0  , :D => 1.6  , :V => 35000.0, :Tr => 360.0 },

{:N =>29     , :Cn => 14000.0  , :Dust=> "2-10"  , :H => 75.0  , :D => 1.7  , :V => 40000.0, :Tr => 365.0 },
{:N =>30     , :Cn => 15000.0  , :Dust=>  ">70"  , :H => 85.0  , :D => 1.8  , :V => 45000.0, :Tr => 370.0 },
{:N =>31     , :Cn => 16000.0  , :Dust=> "2-10"  , :H => 90.0  , :D => 1.9  , :V => 50000.0, :Tr => 375.0 }
]

A = 140.0;  # для Московской, Тульской, Рязанской, Владимирской, Калужской, Ивановской и Брянской областей
F = 2.5;    # Мы всегда берём только Кремний 
NU  = 1.0;  #Тоже жёстко забит

PRECISE = 2;

def print_solution(variant)
  vs = $variants; v = variant - 1;

  n   = vs[v][:N];   
  $Cn  = vs[v][:Cn];
  dust= vs[v][:Dust];
  $H   = vs[v][:H];
  $D   = vs[v][:D];
  $V   = vs[v][:V];
  $Tr  = vs[v][:Tr];

$DT 	= $Tr - 295.5;# Температура по Брянску - температура по варианту. Это дельта-T


$PDKmr = {"2-10" => 0.5, "10-70" => 0.3 , ">70" => 0.15}[dust];
$PDKrz = {"2-10" => 4.0, "10-70" => 1.0 , ">70" => 1.00}[dust];

# результаты
#Сmr_warm = 0; PDKrz_warm = 0;  M_warm = 0; PDV_warm = 0; Z_warm = 0; Xm_warm = 0;
#Сmr_cold = 0; PDKrz_cold = 0;  M_cold = 0; PDV_cold = 0; Z_cold = 0; Xm_cold = 0;


###########################################################
# Дальше не хуй лесть
###########################################################

$step = 0;

yield <<PROBLEM_SITUATION
.----------.----------.----------.-------------------------------------------.
|№         |   Сn,    | Вид пыли |      Сведения об источнике пыли           | 
|варианта  | мг/м^3   |  % SiO2  | H, м     | Д, м     | V, м^3/ч | Tr, K    |
PROBLEM_SITUATION
yield "|----------+----------+----------+----------+----------+----------+----------|"
yield sprintf("|  %-8d|  %-8.2f|  %-8s|  %-8.2f|  %-8.2f|  %-8.2f|  %-8.2f|", n, $Cn, dust, $H, $D, $V, $Tr);
yield "'----------'----------'----------'----------'----------'----------'----------'"

# формула №7
$step += 1;
@m7 = (($Cn * $V) / (3600 * (10 ** 3))).round(PRECISE);

yield <<COMMENT

#{$step}. Находим массу вредного вещества, выбрасываемого в
   атмосферу, в единицу времени г/с по формуле (3):

         C * V
   M = ----------
                3
       3600 * 10
   
       #{$Cn} * #{$V}
   M = ------------------- = #{@m7}
                    3
           3600 * 10

COMMENT

# формула №8
$step += 1;
$V_1 = 	(($V * $Tr) / 
		(273 * 3600)).round(PRECISE);
yield <<COMMENT
                              3
#{$step}. Объём газовоздушной смеси м / c, 
   находим по формуле (8):
           V * T
                r
   V =  ------------
    1    273 * 3600


        #{$V} * #{$Tr}
   V =  ----------------  = #{$V_1}
    1    273.0 * 3600.0

COMMENT


# формула №11
$step += 1;
$W_0 = 	( $V_1 / 
		(0.785 * $D * $D)).round(PRECISE);
yield <<COMMENT
#{$step}. Расчитываем w   ("омега нулевое") - скорость выброса 
                0
   газовоздушной смеси из трубы, м/с; Д - диаметр трубы, м 
   По формуле (11):
             
              1
   W =  ------------
    0             2
         0.785 * Д


             #{$V_1} 
   W =  ----------------  = #{$W_0}
    0                  2
           0.785 * #{$D}

COMMENT

# формула №10
$step += 1;
f = 	( (1000.0 * $W_0 * $W_0 * $D ) / 
		  ($H * $H * $DT )).round(PRECISE);
yield <<COMMENT
#{$step}. Расчитываем вспомогательный параметр f по формуле (10)
                 2
                w   *   Д
         3       0
   f = 10  * ----------------
                2      
               H   * ▲T

                   2
         3     #{$W_0}  * #{$D} 
   f = 10  * ----------------  = #{f}
                   2
               #{$H}  * #{$DT}

COMMENT

# формула №9
$step += 1;
@m9 = 	( (1.0) / 
		  (0.67 +  0.1 * (f ** 0.5) + 0.34 * (f ** (1/3) ))).round(PRECISE);
yield <<COMMENT
#{$step}. Безразмерный коэффициент m расчитывают по формуле (9)
    
                            1
   m =  --------------------------------------
                      1/2           1/3
        0.67 + 0.1 * f    + 0.34 * f

                            1
   m =  -------------------------------------- = #{@m9}
                         1/2             1/3
        0.67 + 0.1 * #{f}    + 0.34 * #{f}

COMMENT

# формула №20
$step += 1;
$Vm_warm = (($V_1 * $DT / $H) ** (1.0 / 3.0)).round(PRECISE);
yield <<COMMENT
#{$step}. Вспомогательный параметр V  (опасная скорость газовоздушной 
                             М
  смеси) для НАГРЕТЫХ выбросов находим по формуле (20)

         _                _ 1/3  
        |   V    *      ▲T |
        |    1             |
   V =  | ---------------  |
    М   |_       H        _|


         _               _ 1/3  
        |   #{$V_1} * #{$DT}   |
   V =  | --------------- |   =  #{$Vm_warm}
    М   |_      #{$H}     _|

COMMENT

# формула  12, 13, 14
def n (_Vm)
	$step += 1;
	yield "#{$step}. Расчитываем безразмерный коэффициент n. V   = #{_Vm}"
  yield "                                             М          "
	if _Vm >= 2 then
		yield "   n = 1 (V  >= 2, формула 12)"
    yield "           М                  "
		1
	elsif (0.5 <= _Vm) and (_Vm < 2) then
		yield ("                2\n" +
   			 "   n = 0.582 * V   - 2.13 * V  + 3.13 (0.5 <= V  <= 2, формула 13)\n" +
         "                М            М                 М                  " )
		yield ("                   2\n" +
			 "   n = 0.582 * #{_Vm}   - 2.13 * #{_Vm} + 3.13 ")

		result = (0.582 * (_Vm ** 2) - 2.13 * _Vm + 3.13).round(PRECISE);
		yield "   n = #{result}"
		result
	else
		yield "   n = 4.4 * V , при V  < 0.5 (формула 14)";
    yield "              М       М                   ";
		yield "   n = #{(4.4 * _Vm).round(PRECISE)}";
		(4.4 * _Vm).round(PRECISE);
	end
end

$n_warm = n($Vm_warm){ |output|
  yield output;
}

# Формула №3
def Cmr_warm ()

	# A в условии
	# M #формула7	OK!
	# F в условии	
  # m #формула9	OK! m9
	# n #формула12, #формула13, #формула14 OK!
	# NU в условии (жёстко-забитый коэффициент)
	# H в условии (высота трубы, м)
	# V1 #формула8  OK!
	# dT определяем в самом начале (для Брянска)
	$step += 1;
	result = ((A * @m7 * F * @m9 * $n_warm * NU) / 
			 ($H **2 * (($V_1 * $DT) ** (1.0/3.0)) )).round(2);
yield <<PRINT
#{$step}. Находим C      для нагретых выбросов по формуле (3):
            M.P.
   Формула 3:
               (A * M  * F * m * n * nu)
   C     =    -------------------------
    M.P.             2             1/3
                    H   *  (V * ▲T)
                             1


               (#{A} * #{@m7}  * #{F} * #{@m9} * #{$n_warm} * #{NU})
   C      =    ---------------------------------------------        = #{result}
    M.P.            2                 1/3
                #{$H}  * (#{$V_1} * #{$DT})
PRINT

	result 

end

$Cmr_warm_result = Cmr_warm(){ |output|
  yield output;
};

# Приложение №3
$step += 1;
yield <<COMMENT
#{$step}. По приложению №3 (таблица) находим предельно допустимую концентрацию 
   кремния в рабочей зоне:

   ПДК    =  #{$PDKmr}
      M.P.
COMMENT

# Приложение №3
$step += 1;
yield <<COMMENT
#{$step}. По приложению №3 (таблица) находим предельно допустимую концентрацию
   кремния в рабочей зоне:

   ПДК    =  #{$PDKrz}
      Р.З.
COMMENT

# формула №4
$step += 1;
$PDV_warm = ( $PDKmr * ($H ** 2 * (($V_1 * $DT) ** (1.0/3.0)) )/
             (A * F * @m9 * $n_warm * NU) ).round(2);
yield <<PRINT
#{$step}. Находим ПДВ для нагретых выбросов по формуле (4):
    Формула 4:
                            2               1/3
                 ПДК    *  H  * (  V * ▲T  )
                    M.P.            1 
    ПДВ =    ----------------------------------
                      (A * F * m * n * nu) 


                               2                1/3
                    #{$PDKmr}  * #{$H}  * (#{$V_1} * #{$DT})
    ПДВ =    -------------------------------------------------   = #{$PDV_warm}
                   (#{A} * #{F} * #{@m9} * #{$n_warm} * #{NU})
PRINT

$step += 1;
$Z_warm = ( (@m7 - $PDV_warm) / @m7 * 100.0).round(2);
yield <<PRINT
#{$step}. Расчитываем требуемую степень очистки Z для нагретых выбросов по
    формуле (22):
            M - ПВД
    Z  =  --------- * 100
              M

            #{@m7} - #{$PDV_warm}
    Z  =  --------------- * 100 = #{$Z_warm}
              #{@m7}

PRINT

# формула №18, №19
def B(_Vm, f, temp)
  $step += 1;
  yield "#{$step}. Значение безразмерного коэффициента Б для #{temp} выбросов "
  if _Vm <= 2 then
    result = (4.95 * _Vm * (1 + 0.28 * (f ** (1.0/3.0)))).round(2);
    yield <<COMMENT
    находим по формуле (18), т.к. V  <= 2  (V  = #{_Vm}):
                                   М         М          
                                  1/3
    Б = 4.95 * V   * (1 + 0.28 * f   )
                М 

                                        1/3
    Б = 4.95 * #{_Vm}   * (1 + 0.28 * #{f}   ) = #{result}
COMMENT
    result
  else
    result = 7.00 * (_Vm ** (1.0/2.0)) * (1 + 0.28 * (f ** (1.0/3.0)));
    yield <<COMMENT
    находим по формуле (19), т.к. V  > 2  (V  = #{_Vm}):
                                            М          
             2                 1/3
    Б = 7 * V   * (1 + 0.28 * f   )
             М 

                  2             1/3
    Б = 7 * #{_Vm}   * (1 + 0.28 * #{f}   ) = #{result}
COMMENT
    result;
  end
end

# формула №18, №19
def Xm(_F, _B, _H, temp)
  $step += 1;
  yield "#{$step}. Расстояние от источника выброса #{temp} вредного  "
  yield "    вещества, на котором устанавливается C      определяется"
  yield "                                          М.Р."
  if _F < 2 then
    result = (_B * _H).round(2);
    yield <<COMMENT
    по формуле (16), т.к. F  < 2  (F  = #{_F}):
                                                       
                                  1/3
    X = Б * Н
     М       
                     
    X = #{_B} * #{_H}  = #{result}
     М
COMMENT
    
  else
    result = ( (5.0 - _F) / 4.0 * _B * _H).round(2);
    yield <<COMMENT
    по формуле (17), т.к. F  >= 2  (F  = #{_F}):

           5 - F      
    X  =  ------- * Б * Н
     М       4 

           5 - #{_F}      
    X  =  --------- * #{_B} * #{_H} = #{result}
     М       4 
COMMENT
  end

  result
end

$B_warm = B($Vm_warm, f, "нагретых"){|output| yield output};

$Xm_warm = Xm(F, $B_warm, $H, "нагретого") {|output| yield output} ;

# формула №15
$step += 1;
$K = (  ( $D * 3600.0 )/
       ( 8.0 * $V    )).round(2);
yield <<PRINT

==================================================================
Для того, чтобы найти С     и ПДВ для холодных выбросов, надо
                       М.Р.
найти коэффициент "К" и пересчитать параметры "n" и "V " 
                                                      М
==================================================================
                         2
#{$step}. Коэффициент K ( с / м  ) определяют по формуле (15):
    Формула 15:
              Д * 3600
    K   =    ----------
                8 * V            

              #{$D}  * 3600
    K   =    ---------------   = #{$K}
              8 * #{$V}
PRINT


# формула №21
$step += 1;
$Vm_cold = (1.3 * $W_0 / $H).round(PRECISE);
yield <<COMMENT
#{$step}. Вспомогательный параметр V  (опасная скорость газовоздушной 
                              М
   смеси) для ХОЛОДНЫХ выбросов находим по формуле (21)  (w - "омега нулевое" )
                                                           0
   Формула 21:
                  w
                   0
   V =  1.3  --------------- 
    М             H

                  #{$W_0}
   V =  1.3  ---------------  = #{$Vm_cold}
    М             #{$H}

COMMENT

n_cold = n($Vm_cold){ |output|
  yield output;
};

# формула №5
$step += 1;
$Cmr_cold = ($K * A * @m7 * F * n_cold *  NU / ($H ** (4.0/3.0))).round(PRECISE);
yield <<COMMENT
#{$step}. Находим C    для холодных выбросов по формуле (5):
             M.P.
    Формула 5:
             A * M * F * n * nu     
   C    =  -------------------- * K
    M.P.              4/3
                     H

             #{A} * #{@m7} * #{F} * #{n_cold} * #{NU}     
   C    =  --------------------------------------- * #{$K} = #{$Cmr_cold}
    M.P.                 4/3
                     #{$H}
COMMENT


$step += 1;
$PDV_cold = ( $PDKmr * ($H ** (4.0/3.0))/
             (A * F * n_cold * NU * $K) ).round(2);
yield <<PRINT
#{$step}. Находим ПДВ для холодных выбросов по формуле (6):
    Формула 6:
                                4/3
                     ПДК    *  H    
                        M.P.
    ПДВ =    -------------------------
                A * F * n * nu * L


                                    4/3
                         #{$PDKmr}  * #{$H}  
    ПДВ =    ----------------------------------------   = #{$PDV_cold}
               #{A} * #{F} * #{n_cold} * #{NU} * #{$K}
PRINT

$step += 1;
$Z_cold = ( (@m7 - $PDV_cold) / @m7 * 100.0).round(2);

yield <<PRINT
#{$step}. Расчитываем требуемую степень очистки Z  для холодных выбросов по
    формуле (22):
            M - ПДВ
    Z  =  --------- * 100
              M

            #{@m7} - #{$PDV_cold}
    Z  =  --------------- * 100 = #{$Z_cold}
              #{@m7}

PRINT

$B_cold = B($Vm_cold, f, "холодных"){|output| yield output};
$Xm_cold = Xm(F, $B_cold, $H, "холодного") {|output| yield output};

yield "Выпишем полученные результаты в таблицу:"
yield ".----------.----------.----------.----------.----------.----------.----------.----------."
yield "|Выбросы   |    C     |   C      | ПДК      |    M,    |   ПДВ,   |     Z,   |     X    |"
yield "|          |     п    |    М.Р.  |    Р.З.  |          |          |          |      М   |"
yield "|          |        3 |      3   |      3   |          |          |          |          |"
yield "|          |     мг/м |  мг/м    |  мг/м    |   г/с    |   г/с    |     %    |     M    |"
yield "|----------|----------|----------|----------|----------|----------|----------|----------|"
yield (sprintf "|Нагретые  |%-10.2f|%-10.2f|%-10.2f|%-10.2f|%-10.2f|%-10.2f|%-10.2f|", $Cn, $Cmr_warm_result, $PDKrz, @m7, $PDV_warm, $Z_warm, $Xm_warm)
yield "|----------|----------|----------|----------|----------|----------|----------|----------|"
yield (printf "|Холодные  |%-10.2f|%-10.2f|%-10.2f|%-10.2f|%-10.2f|%-10.2f|%-10.2f|", $Cn, $Cmr_cold, $PDKrz, @m7, $PDV_cold, $Z_cold, $Xm_cold)
yield "'----------'----------'----------'----------'----------'----------'----------'----------'"
end
